OF/incompressible/simpleFoam/pitzDaily/0.orig/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2112                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "<case>/config"

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform $epsilon;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform $epsilon;
    }
    outlet
    {
        type            zeroGradient;
    }
    upperWall
    {
        lowReCorrection 0;
        blending        stepwise;
        n               2;
        type            epsilonWallFunction;
        value           uniform $epsilon;
    }
    lowerWall
    {
        lowReCorrection 0;
        blending        stepwise;
        n               2;
        type            epsilonWallFunction;
        value           uniform $epsilon;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
