OF/incompressible/simpleFoam/pitzDaily/system/ITHACA-FVControls
potentialFlow
{
    nNonOrthogonalCorrectors 10;
}
